---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\kolloj\becker\sf\Table_8.log
  log type:  text
 opened on:  25 May 2024, 20:40:52

. use y1.dta,clear
(Javítva 2013 01.21 rossz teladatok kidobva(telkod telnev ksh4_lak teltip_l megye)

. 
. set more off

. 
. *This one estimates the choice of Jobbik, and strong agreement with statement df5b: The problems of Gypsies would be solved if they finally started to work
. 
. regress df5b srch_roma srch_n o lany i.kor i.anya if roma==0 [aw=suly], rob
(sum of wgt is 48,592.6649032235)

Linear regression                               Number of obs     =      4,251
                                                F(13, 4237)       =      38.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0061
                                                Root MSE          =     .49811

-------------------------------------------------------------------------------
              |               Robust
         df5b |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
    srch_roma |  -.2824824   .1728158    -1.63   0.102    -.6212919    .0563271
srch_non_roma |   .0403413   .2307635     0.17   0.861    -.4120761    .4927587
            o |  -.0207579   .0099713    -2.08   0.037    -.0403068    -.001209
         lany |  -.0163115    .018307    -0.89   0.373    -.0522028    .0195798
              |
          kor |
          18  |    .020289   .0207522     0.98   0.328    -.0203961    .0609742
          19  |   .0242344   .0371836     0.65   0.515    -.0486649    .0971336
          20  |   .1133157   .0744249     1.52   0.128     -.032596    .2592275
          21  |  -.1297211    .140642    -0.92   0.356     -.405453    .1460108
          22  |  -.4743323   .0347576   -13.65   0.000    -.5424754   -.4061892
              |
     anyaisk5 |
      8 ált.  |  -.0715018   .0592885    -1.21   0.228    -.1877383    .0447347
      szakma  |  -.0318131   .0588835    -0.54   0.589    -.1472555    .0836294
   érettségi  |  -.0155841   .0592248    -0.26   0.792    -.1316958    .1005275
     diploma  |  -.0229908   .0618765    -0.37   0.710    -.1443012    .0983195
              |
        _cons |   .5781201   .0850721     6.80   0.000     .4113342    .7449061
-------------------------------------------------------------------------------

. lincom srch_roma-srch_n

 ( 1)  srch_roma - srch_non_roma = 0

------------------------------------------------------------------------------
        df5b |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3228237   .3713238    -0.87   0.385    -1.050813    .4051656
------------------------------------------------------------------------------

. gen esample=e(sample)

. 
. regress jobbik srch_roma srch_n  o lany i.kor i.anya if roma==0 & esample [aw=suly], rob
(sum of wgt is 48,592.6649032235)

Linear regression                               Number of obs     =      4,251
                                                F(13, 4237)       =       9.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0240
                                                Root MSE          =     .34112

-------------------------------------------------------------------------------
              |               Robust
       jobbik |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
    srch_roma |  -.0909136   .1259303    -0.72   0.470     -.337803    .1559757
srch_non_roma |  -.0743685   .1689402    -0.44   0.660    -.4055799    .2568428
            o |  -.0008433   .0069849    -0.12   0.904    -.0145373    .0128506
         lany |  -.0883332    .012627    -7.00   0.000    -.1130888   -.0635776
              |
          kor |
          18  |  -.0075514   .0146266    -0.52   0.606    -.0362272    .0211244
          19  |  -.0272999   .0235653    -1.16   0.247    -.0735003    .0189005
          20  |  -.0793066   .0320742    -2.47   0.013    -.1421888   -.0164244
          21  |   .2923763   .1921047     1.52   0.128    -.0842496    .6690023
          22  |   -.128787   .0268553    -4.80   0.000    -.1814375   -.0761365
              |
     anyaisk5 |
      8 ált.  |   .0108643    .028421     0.38   0.702    -.0448557    .0665843
      szakma  |   .0708416   .0298708     2.37   0.018     .0122791    .1294041
   érettségi  |   .0744831   .0303411     2.45   0.014     .0149986    .1339675
     diploma  |   .0643102   .0332047     1.94   0.053    -.0007883    .1294088
              |
        _cons |   .1888977   .0517509     3.65   0.000     .0874388    .2903566
-------------------------------------------------------------------------------

. lincom srch_roma-srch_n

 ( 1)  srch_roma - srch_non_roma = 0

------------------------------------------------------------------------------
      jobbik |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0165451   .2729671    -0.06   0.952    -.5517036    .5186134
------------------------------------------------------------------------------

. 
. 
. 
. set more on

. log close
      name:  <unnamed>
       log:  c:\kolloj\becker\sf\Table_8.log
  log type:  text
 closed on:  25 May 2024, 20:40:52
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
